In [24]:
# Importação das bibliotecas e criação do Dataframe
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [2]:
# Método unique() mostra os valores unicos presentes (nesse caso na series col2)
df['col2'].unique()

array([444, 555, 666])

In [3]:
# Importação da numpy
import numpy as np

In [4]:
# Basicamente o mesmo método (pandas é feita com base na numpy)
np.unique(df['col2'])

array([444, 555, 666])

In [5]:
# Se a função acima retornava uma array com os elementos unicos, o seu tamanho será o numero de elementos unicos
len(df['col2'].unique())

3

In [7]:
# Basicamente um método que realiza a tarefa acima
df['col2'].nunique()

3

In [8]:
# Função que conta as aparições de valores unicos em dada consulta
df['col2'].value_counts()

col2
444    2
555    1
666    1
Name: count, dtype: int64

In [12]:
# Exemplo de consulta personalizada, para adicionar multiplos condicionais é necessario utilizar o operador & para and e | para or
df[ (df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [14]:
# Definição de uma função de elevar um inteiro ao quadrado
def vezes2(x):
    return x*2

In [17]:
# Método apply() permite aplicar (literalmente) funções ao dataset
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [18]:
# Método apply() permite aplicar (literalmente) funções ao dataset
df['col1'].apply(lambda x: x*x)

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

In [19]:
# Para manter as alterações, é ncessasario o parametro inplace
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [20]:
# Outra forma de deletar uma coluna, analoga ao drop() com inplace = true
del df['col2']

In [21]:
df

   col1 col3
0     1  abc
1     2  def
2     3  ghi
3     4  xyz

In [22]:
# Listagen das colunas do datafram
df.columns

Index(['col1', 'col3'], dtype='object')

In [23]:
# Listadgem dos indices (linhas) do dataframe
df.index

RangeIndex(start=0, stop=4, step=1)

In [26]:
# Método que ordena valores
df.sort_values(by='col2', inplace=True)

In [28]:
# Método que retorna um dataframe booleano, indicando valores nulos
df.isnull()

    col1   col2   col3
0  False  False  False
3  False  False  False
1  False  False  False
2  False  False  False

In [29]:
# Método que remove valores nulos
df.dropna()

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [30]:
# Criação de um dataframe com 2 valores nulos
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [32]:
# fillna pode receber parametros de como completar os valores faltantes, nesse caso a média da coluna 1
df['col1'].fillna(value=df['col1'].mean())

0    1.0
1    2.0
2    3.0
3    2.0
Name: col1, dtype: float64

In [34]:
# Ultimo dataframe do módulo
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [35]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [36]:
# Essa função reorganiza o dataframe, agrupando em novas categorias que podem se formar dentro dos dados (como 1 ou 2, bar ou foo etc)
df.pivot_table(values='D', index=['A', 'B'], columns='C')

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN